load_test.yaml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 50
  defaults:
    headers:
      Accept: "application/json"
scenarios:
  - flow:
      - get:
          url: "/data"
          capture:
            - json: "0"  
              as: "dataResponse"
      - log: "Captured response from /data: {{ dataResponse }}"
  - flow:
      - post:
          url: "/getWeatherByCity"
          json:
            city: "Cairo"
          capture:
            - json: "$"
              as: "cityWeatherTemperature"
      - log: "Captured response from /cityWeatherTemperature: {{ cityWeatherTemperature }}"
  - flow:
      - post:
          url: "/getWeatherByGeo"
          json:
            latitude: "30.0444"
            longitude: "31.2357"
            threshold: "10"
          capture:
            - json: "$"  # Captures temperature from the response
              as: "geoWeatherTemperature"
      - log: "Captured response from /getWeatherByGeo: {{ geoWeatherTemperature }}"
  - flow:
      - post:
          url: "/getAggregatedWeather"
          json:
            latitude: "24.45118"
            longitude: "54.39696"
            radius: "10"
          capture:
            - json: "$"  # Captures the average temperature
              as: "aggregatedAvgTemperature"
      - log: "Captured response from /getAggregatedWeather: {{ aggregatedAvgTemperature }}"